#На вход программе подается натуральное число n.Напишите программу, которая печатает звездный прямоугольник размерами nx19.
paswd1=input()
paswd2=input()
if paswd1==paswd2:
    print("Пароль принят")
else:
    print("Пароль не принят")