'''
Дано положительное действительное число. Выведите его дробную часть.
'''
number=float(input())
n1=int(number)
n2=number-n1
print(n2)