#Напишите программу, которая считывает строку-разделитель и три строки, а затем выводит указанные строки через разделитель.
symbol=input()
text1=input()
text2=input()
text3=input()
print(text1, text2, text3, sep=symbol)